DataProcessors/бит_ДополнительнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ДополнительнаяИнформация</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиПользователей</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Comment>Значение настройки</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Comment>Настройка</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/бит_ДополнительнаяИнформация/Forms/ФормаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем мПервоначальноеЗначениеПоказывать; // Хранит признак того, что форму обработки нужно открывать.
// При запуске системы для текущего пользователя.

&НаКлиенте
Перем мИсторияПросмотра; // Список доступных страниц.

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Cтандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);
	
	КоллекцияМакетов = Метаданные.Обработки.бит_ДополнительнаяИнформация.Макеты;
	Если КоллекцияМакетов.Количество() = 0 Тогда
		фОтказ = Истина;
		Возврат;
	КонецЕсли;
	
	фСодержаниеСформировано = Ложь;
	          	
	// Получим значение признака необходимости открывать форму при начале работы системы. 
	// Для текущего пользователя.
	фТекущийПользователь      = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"); 	
	ПоказыватьПриНачалеРаботы = бит_УправлениеПользователямиСервер.ПолучитьНастройкуПользователя("ПоказыватьДополнительнуюИнформациюБит", фТекущийПользователь);

	ТекОбработка  = РеквизитФормыВЗначение("Объект");
	   		
	// Покажем первый макет в поле HTML документа.
	мТекущийМакет 	  = ТекОбработка.ПолучитьМакет("Главная");
	
	ТекстХТМЛ = мТекущийМакет.ПолучитьТекст();
	
	СсылкаКартинки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.бит_ТСЖ, УникальныйИдентификатор);
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%src%", СсылкаКартинки);
	
	ПолеHTMLДокумента = ТекстХТМЛ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда	
		Отказ = Истина;
		Возврат; 	
	КонецЕсли;
	    			
	// Сохраняем первоначальное значение признака необходимости открывать форму при начале работы системы. 
	// Для текущего пользователя.
	мПервоначальноеЗначениеПоказывать = ПоказыватьПриНачалеРаботы;
		   	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеHTMLДокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Свойство("href") Тогда
		
		СтандартнаяОбработка = Ложь;
		ИмяОткрываемойСтраницы = ДанныеСобытия.href;
		Если ИмяОткрываемойСтраницы <> Неопределено Тогда
		 	ЗапуститьПриложение(ИмяОткрываемойСтраницы);					
		КонецЕсли;       		
	 		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПриНачалеРаботыПриИзменении(Элемент)
	
	Если мПервоначальноеЗначениеПоказывать <> ПоказыватьПриНачалеРаботы Тогда		
		ПоказыватьПриНачалеРаботыПриИзмененииСервер(фТекущийПользователь,ПоказыватьПриНачалеРаботы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ПерейтиНаГлавную(Команда)
	
	ПерейтиНаГлавнуюСтраницу();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения
               
// Процедура выполняет действия на сервере, необходимые при закрытии формы.
//
&НаСервереБезКонтекста
Процедура ПоказыватьПриНачалеРаботыПриИзмененииСервер(фТекущийПользователь, ПоказыватьПриНачалеРаботы)
	
	Настройка = ПланыВидовХарактеристик.бит_НастройкиПользователей.ПоказыватьДополнительнуюИнформациюБит;
	
	НаборЗаписей = РегистрыСведений.бит_НастройкиПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(фТекущийПользователь);
	НаборЗаписей.Отбор.Настройка.Установить(Настройка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь 	 = фТекущийПользователь;
	Запись.Настройка 		 = Настройка;
	Запись.ЗначениеНастройки = ПоказыватьПриНачалеРаботы;
	
	НаборЗаписей.Записать();
		
КонецПроцедуры

&НаСервере
Процедура ПерейтиНаГлавнуюСтраницу()
	              	 
	ТекОбработка      = РеквизитФормыВЗначение("Объект");
	мТекущийМакет 	  = ТекОбработка.ПолучитьМакет("Главная");
	
	ТекстХТМЛ = мТекущийМакет.ПолучитьТекст();
	
	СсылкаКартинки = ПолучитьНавигационнуюСсылку(БиблиотекаКартинок.бит_ТСЖ);
	
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%src%", СсылкаКартинки);
	
	ПолеHTMLДокумента =  ТекстХТМЛ;
	
КонецПроцедуры

#КонецОбласти
